'''
1. Створити функцію- генератор, яка прийматиме рандомну кількість елементів, та в результаті
виклику додаватиме ці елементи в словник, де ключем виступатиме сам елемент послідовності,
а в якості значення- елемент + 1

2. Створити функцію-генератор яка приймає параметр limit. У діапазоні аргумента limit,
щоразу повертати наступний елемент. Для цього використайте for, range, yield. Вивести перші
3 елементи цього генератора, за умови, що ці елементи є не парними числами
'''

import sys

def gen1(a):
    lst = [i + 1 for i in a]
    dct = {i: j for i, j in zip(a, lst)}
    yield dct
n = gen1((1, 3, 5, 7, 9))
print(next(n))

def gen2():
    for i in range(6):
        if i % 2 != 0:
            yield i
m = gen2()
print(next(m))
print(next(m))
print(next(m))